/* ===== Generic ===== */

/* Generic Cancel button title, used in SKConversation NSErrorFromPREMIUM_VIDEO_STATUS */
"BUTTONTITLE_CANCEL" = "Hủy bỏ";

/* ===== SkyLib Properties ===== */

/* List item title for user's home phone number. */
"CONTACT_PHONE_HOME" = "Số nhà riêng";

/* List item title for user's office phone number */
"CONTACT_PHONE_OFFICE" = "Số cơ quan";

/* List item title for user's mobile phone number. */
"CONTACT_PHONE_MOBILE" = "Số di động";

/* List item title for user's (possible) other phone number(s). */
"CONTACT_PHONE_OTHER" = "Số khác";

/* Format to use to wrap guest contact displays */
"CONTACT_GUEST_FORMAT" = "%@ (Khách)";

/* All known contacts group title */
"CONTACT_GROUP_ALL_KNOWN_CONTACTS" = "Tất cả Liên hệ Đã biết";

/* All buddies group title */
"CONTACT_GROUP_ALL_BUDDIES" = "Tất cả Liên hệ";

/* Skype group title */
"CONTACT_GROUP_SKYPE_BUDDIES" = "Liên hệ trên Skype";

/* SkypeOut group title */
"CONTACT_GROUP_SKYPEOUT_BUDDIES" = "Lưu Số Điện thoại";

/* Online buddies group title */
"CONTACT_GROUP_ONLINE_BUDDIES" = "Liên hệ Online";

/* Unknown or pending auth group title */
"CONTACT_GROUP_UNKNOWN_OR_PENDINGAUTH_BUDDIES" = "Đã gửi Yêu cầu";

/* Recently contacted group title */
"CONTACT_GROUP_RECENTLY_CONTACTED_CONTACTS" = "Liên hệ Gần đây";

/* Contacts waiting my auth group title */
"CONTACT_GROUP_CONTACTS_WAITING_MY_AUTHORIZATION" = "Đã nhận Yêu cầu";

/* Authorized by me group title */
"CONTACT_GROUP_CONTACTS_AUTHORIZED_BY_ME" = "Yêu cầu Đã được chấp nhận";

/* Blocked group title */
"CONTACT_GROUP_CONTACTS_BLOCKED_BY_ME" = "Liên hệ Bị chặn";

/* Ungrouped contacts group title */
"CONTACT_GROUP_UNGROUPED_BUDDIES" = "Liên hệ bị Bỏ nhóm";

/* Windows Live ID contacts group title */
"CONTACT_GROUP_PASSPORT_CONTACTS" = "Messenger";

/* Suggested contacts group title */
"CONTACT_GROUP_SCD_CONTACTS" = "Liên hệ Đề xuất";

/* New group default title */
"CONTACT_GROUP_NEW_GROUP" = "Danh sách Chưa có tên";

/* Default message sent to contacts from whom we are requesting authorization */
"CONTACT_AUTH_REQUEST_DEFAULT_MESSAGE" = "Vui lòng thêm tôi làm liên hệ";

/*  */
"ECHO123_CONTACT_FULLNAME" = "Gọi điện kiểm tra trên Skype";

/*  */
"ECHO123_CONTACT_LANGUAGES" = "vi";

/*  */
"ECHO123_CONTACT_HOMEPAGE" = "www.skype.com/go/help";

/* Automatic sound test service mood message. */
"ECHO123_CONTACT_ABOUT" = "Xin chào, tôi là rô-bốt gọi điện kiểm tra trên Skype. Hãy thêm tôi làm liên hệ của bạn và gọi điện cho tôi để kiểm tra thiết lập âm thanh của bạn. Hãy xem http://www.skype.com/go/help để được trợ giúp thêm. Xin cảm ơn.";

/*  */
"ECHO123_CONTACT_MOOD_TEXT" = "Gọi điện cho tôi để kiểm tra âm thanh của bạn";


/* UNPLACED call status used when a call is initialized, but not connected to the network yet. */
"CALL_STATUS_UNPLACED" = "Thực hiện cuộc gọi của bạn";

/* ROUTING call status used when a call is being routed by the network but not ringing yet. */
"CALL_STATUS_ROUTING" = "Thực hiện cuộc gọi của bạn";

/* CANCELLED call status indicating that the outgoing call was cancelled by the user. */
"CALL_STATUS_CANCELLED" = "Đã hủy bỏ cuộc gọi";

/* FAILED call status used when the call failed. */
"CALL_STATUS_FAILED" = "Không thực hiện được cuộc gọi";

/* RINGING_OUT call status used when a call is ringing for the remote party. */
"CALL_STATUS_RINGING_OUT" = "Đổ chuông";

/* RINGING_IN call status used when a call is ringing locally. */
"CALL_STATUS_RINGING_IN" = "Đang gọi";

/* LOCALHOLD call status indicating that the user put the call on hold. */
"CALL_STATUS_LOCALHOLD" = "Cuộc gọi đang chờ";

/* REMOTEHOLD call status indicating that the call is on hold by the remote party. */
"CALL_STATUS_REMOTEHOLD" = "Bạn đang chờ cuộc gọi";

/* FINISHED call status indicating that the call was finished. */
"CALL_STATUS_FINISHED" = "Đã hoàn thành";

/* MISSED call status indicating that the incoming call was finished before it got answered. */
"CALL_STATUS_MISSED" = "Đã bị nhỡ";

/* REFUSED call status indicating that the remote party declined the call. */
"CALL_STATUS_REFUSED" = "Đã từ chối";

/* BUSY call status indicating that the remote party was already in a call. */
"CALL_STATUS_BUSY" = "Máy bận";

/* DROPPED call status indicating that the network connection was lost during the call. */
"CALL_STATUS_DROPPED" = "Đã mất kết nối";

/* VOICEMAIL call status indicating that the call was diverted to voicemail. */
"CALL_STATUS_VOICEMAIL" = "Tin nhắn thoại";

/* VM_RECORDING call status while recording the voicemail. */
"CALL_STATUS_VM_RECORDING" = "Đang ghi âm tin nhắn thoại";

/* VM_UPLOADING call status while sending the voicemail. */
"CALL_STATUS_VM_UPLOADING" = "Đang gửi tin nhắn thoại";

/* VM_SENT call status after the voicemail was sent. */
"CALL_STATUS_VM_SENT" = "Đã gửi tin nhắn thoại";

/* VM_CANCELLED call status when the recording or sending of the voicemail was cancelled. */
"CALL_STATUS_VM_CANCELLED" = "Đã hủy bỏ tin nhắn thoại";

/* VM_FAILED call status when the recording or sending of the voicemail failed. */
"CALL_STATUS_VM_FAILED" = "Không gửi được tin nhắn thoại";

/* ===== Wallet Transacation ===== */
/* Title of instrument name in popup button (args: instrument name ["Visa"], number ["****1234"]) */
"WALLET_INSTRUMENT_DISPLAY_NAME_FORMAT" = "%1$@ %2$@";


/* ===== PARTICIPANT_VOICE_STATUS ===== */ 

/* VOICE_CONNECTING status used when a call is being routed by the network but not ringing yet. */
"PARTICIPANT_VOICE_STATUS_CONNECTING" = "Đang kết nối";

/* RINGING status when a participant is ringing. */
"PARTICIPANT_VOICE_STATUS_RINGING" = "Đổ chuông";

/* EARLY_MEDIA status when a participant is ringing. */
"PARTICIPANT_VOICE_STATUS_EARLY_MEDIA" = "Đổ chuông";

/* ON_HOLD status when a participant is held. */
"PARTICIPANT_VOICE_STATUS_ON_HOLD" = "Đang Chờ";

/* STOPPED status when a participant has stopped. */
"PARTICIPANT_VOICE_STATUS_STOPPED" = "Đã kết thúc";

/* FACEBOOK calling */
"PARTICIPANT_VOICE_STATUS_CONNECTING_FACEBOOK" = "Đang gọi trên Facebook (phiên bản Beta)";

/* ===== CONVERSATION_LOCAL_LIVESTATUS ===== */ 
"CONVERSATION_LOCAL_LIVESTATUS_STARTING" = "Đang gọi…";
"CONVERSATION_LOCAL_LIVESTATUS_RINGING_FOR_ME" = "Đang gọi…";
"CONVERSATION_LOCAL_LIVESTATUS_IM_LIVE" = "Đang gọi";
"CONVERSATION_LOCAL_LIVESTATUS_ON_HOLD_LOCALLY" = "Đang chờ";
"CONVERSATION_LOCAL_LIVESTATUS_ON_HOLD_REMOTELY" = "Bạn đang chờ cuộc gọi";
"CONVERSATION_LOCAL_LIVESTATUS_OTHERS_ARE_LIVE" = "Đang gọi";
"CONVERSATION_LOCAL_LIVESTATUS_OTHERS_ARE_LIVE_FULL" = "Cuộc gọi đã đầy";
"CONVERSATION_LOCAL_LIVESTATUS_PLAYING_VOICE_MESSAGE" = "Đang phát lời chào tin nhắn thoại";
"CONVERSATION_LOCAL_LIVESTATUS_RECORDING_VOICE_MESSAGE" = "Đang ghi âm tin nhắn thoại";
"CONVERSATION_LOCAL_LIVESTATUS_RECENTLY_LIVE" = "Cuộc gọi gần đây";
"CONVERSATION_LOCAL_LIVESTATUS_TRANSFERRING" = "Đang chuyển cuộc gọi này";


/*  */
"CONVERSATION_POST_FILES_BODY" = "Tệp đã đăng";

/* CONVERSATION Legacy chat message for older clients */
"CONVERSATION_VIDEOMESSAGE_LEGACY_MESSAGE" = "Bạn đã nhận được một tin nhắn video mới. Hãy xem tin nhắn tại: %1 và mở tin nhắn bằng mã %2";

"CONVERSATION_XMM_LEGACY_MESSAGE" = "%1$@ - xem tại %%1.";

"CONVERSATION_MEDIAMESSAGE_LEGACY_MESSAGE" = "Để xem ảnh được chia sẻ này, hãy đi tới: %1";
"CONVERSATION_XMM_MESSAGE_LEGACY_MESSAGE" = "Để xem phương tiện được chia sẻ này, hãy đi tới: %1";

/*  */
"CONTACT_AVAILABILITY_OFFLINE" = "Offline";
"CONTACT_AVAILABILITY_ONLINE" = "Online";
"CONTACT_AVAILABILITY_AWAY" = "Vắng mặt";
"CONTACT_AVAILABILITY_DO_NOT_DISTURB" = "Không Làm Phiền";
"CONTACT_AVAILABILITY_PENDING_AUTH" = "Yêu cầu liên hệ đang treo";
"CONTACT_AVAILABILITY_BLOCKED" = "Bị chặn";
"CONTACT_AVAILABILITY_OFFLINE_BUT_VM_ABLE" = "Offline với chế độ gửi tin nhắn thoại";
"CONTACT_AVAILABILITY_OFFLINE_BUT_CF_ABLE" = "Chuyển tiếp cuộc gọi";

/*  */
"CONTACT_AVAILABILITY_INVISIBLE" = "Ẩn";
"CONTACT_AVAILABILITY_CONNECTING" = "Đang kết nối";
"CONTACT_AVAILABILITY_SKYPEOUT" = "Số điện thoại";

/*  */
"CONTACT_GENDER_FEMALE" = "Nữ";

/*  */
"CONTACT_GENDER_MALE" = "Nam";

/* A hidden phone number. */
"CONTACT_UNKNOWN_PSTN_DISPLAYNAME" = "Số không xác định";

/* Title for conversation with no participants */
"CONVERSATION_UNTITLED_DISPLAYNAME" = "Chưa có tên";


"ACCOUNTMANAGER_LOGIN_STATUS" = "Đang đăng nhập…";
"ACCOUNTMANAGER_CBLSYNC_STATUS" = "Đang tải danh bạ…";
"ACCOUNTMANAGER_UPGRADEDB_STATUS" = "Đang nâng cấp các tệp…";


/* Chat info message when a party has been joined to the chat. %1$@ is the name of the user who did the adding, while %2$@ is the name of the added user. */
"ChatMessage::ADDEDMEMBERS_FORMATSTRING" = "%1$@ đã thêm %2$@";

/* Chat info message shown when user %@ has left the chat. */
"ChatMessage::LEFT_FORMATSTRING" = "%@ đã rời";

/* Chat info message when the first user ejected (threw out) the second user from the chat. */
"ChatMessage::KICKED_FORMATSTRING" = "%1$@ đã loại bỏ %2$@";

/* Chat info message shown when a party has changed the chat topic. %1$@ is the user who did it, and %2$@ the new topic. */
"ChatMessage::SETTOPIC_FORMATSTRING" = "%1$@ đã thay đổi chủ đề trò chuyện thành %2$@";

/* Chat item shown in place of the message to tell that the message has been removed by its writer. */
"CHATMESSAGE_MESSAGEREMOVED_TEXT" = "Tin nhắn này đã bị loại bỏ";

/* AV Preferences output device name */
"SAME_AS_SYSTEM_DEVICE_NAME" = "Giống như Hệ thống";


/* ===== SkyLib Error/Result Codes ===== */

/* sync errors at login/registration */
"LOGOUTREASON_NETWORKERROR" = "Không thể kết nối với Skype.";
"LOGOUTREASON_NETWORKERROR_RECOVERYSUGGESTION" = "Vui lòng kiểm tra thiết đặt mạng và thử lại.";

/* sync errors at registration */
"Account::INVALID_SKYPENAME" = "Tên Skype này không hợp lệ.";
"Account::INVALID_EMAIL" = "Địa chỉ email này không hợp lệ.";
"Account::INVALID_EMAIL_RECOVERYSUGGESTION" = "Vui lòng kiểm tra và thử lại.";
"Account::UNACCEPTABLE_PASSWORD" = "Mật khẩu này không hợp lệ.";
"Account::SKYPENAME_TAKEN" = "Tên Skype này đã được sử dụng.";
"Account::SKYPENAME_TAKEN_RECOVERYSUGGESTION" = "Vui lòng nhập một tên mới.";

/* sync errors at login */
"Account::NO_SUCH_IDENTITY" = "Chúng tôi không nhận dạng được Tên Skype và mật khẩu của bạn.";
"Account::INCORRECT_PASSWORD" = "Chúng tôi không nhận dạng được Tên Skype và mật khẩu của bạn.";
"Account::TOO_MANY_LOGIN_ATTEMPTS" = "Bạn đã đăng nhập quá nhiều lần không thành công.";
"Account::TOO_MANY_LOGIN_ATTEMPTS_RECOVERYSUGGESTION" = "Vui lòng thử lại sau.";

/* async errors (can happen anytime while logged in) */
"Account::PASSWORD_HAS_CHANGED" = "Mật khẩu của bạn đã thay đổi.";
"Account::PASSWORD_HAS_CHANGED_RECOVERYSUGGESTION" = "Vui lòng đăng nhập bằng mật khẩu mới của bạn.";

"LOGOUTREASON_GENERIC_RECOVERYSUGGESTION" = "Vui lòng thử lại.";

/* Account property validation error - NSLocalizedFailureReasonErrorKey [#HELLC-1021], [#WIN-364] */
"SkyLib::TOO_SHORT" = "Cần dài từ 6 đến 20 ký tự.";
"SkyLib::TOO_LONG" = "Cần dài từ 6 đến 20 ký tự.";
"SkyLib::CONTAINS_INVALID_CHAR" = "Ký tự không hợp lệ, ví dụ: Σ, à, ß.";
"SkyLib::CONTAINS_SPACE" = "Không được chứa dấu cách hoặc tab.";
"SkyLib::SAME_AS_USERNAME" = "Quá giống với Tên Skype của bạn.";
"SkyLib::INVALID_FORMAT" = "Định dạng không hợp lệ.";
"SkyLib::CONTAINS_INVALID_WORD" = "Quá dễ đoán, ví dụ: abcd, skype.";
"SkyLib::TOO_SIMPLE" = "Cần có ít nhất 1 chữ cái và 1 số.";
"SkyLib::STARTS_WITH_INVALID_CHAR" = "Phải bắt đầu bằng một chữ cái (A–Z).";

/* Account property validation error - NSLocalizedRecoverySuggestionErrorKey */
"SkyLib::TOO_SHORT_RECOVERYSUGGESTION_CONTACT_SKYPENAME" = "Hãy thử một Tên Skype dài hơn.";
"SkyLib::TOO_SHORT_RECOVERYSUGGESTION_ACCOUNT_PASSWORD" = "Hãy thử mật khẩu dài hơn.";
"SkyLib::TOO_LONG_RECOVERYSUGGESTION_CONTACT_SKYPENAME" = "Hãy thử Tên Skype ngắn hơn.";
"SkyLib::TOO_LONG_RECOVERYSUGGESTION_ACCOUNT_PASSWORD" = "Hãy thử mật khẩu ngắn hơn.";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION_CONTACT_SKYPENAME" = "Hãy thử Tên Skype mới.";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION_ACCOUNT_PASSWORD" = "Hãy thử mật khẩu mới.";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION_CONTACT_EMAILS" = "Hãy thử địa chỉ email mới.";
"SkyLib::VALIDATERESULT_RECOVERYSUGGESTION" = "Hãy thử giá trị mới.";

/* Account password change error - NSLocalizedFailureReasonErrorKey */
"Account::PWD_INVALID_OLD_PASSWORD" = "Mật khẩu không đúng.";
"Account::PWD_SERVER_CONNECT_FAILED" = "Không thể kết nối với máy chủ.";
"Account::PWD_MUST_DIFFER_FROM_OLD" = "Mật khẩu mới phải khác mật khẩu cũ.";
"Account::PWD_INVALID_NEW_PWD" = "Mật khẩu này không hợp lệ.";
"Account::PWD_MUST_LOG_IN_TO_CHANGE" =  "Bạn phải đăng nhập để có thể đổi mật khẩu của mình.";

/* COMMITFAILED status received when committing a server-side property change. */
"ACCOUNT_COMMITSTATUS_COMMIT_FAILED" = "Không thể lưu được thay đổi của bạn. Hãy kiểm tra thiết đặt và thử lại.";

"ACCOUNT_NOCREDIT" = "Không có tín dụng";
"ACCOUNT_FREECALL" = "Cuộc gọi miễn phí";

/* Conversation file transfer errors */
"SkyLib::TRANSFER_BAD_FILENAME" = "Tên tệp không hợp lệ";
"SkyLib::TRANSFER_OPEN_FAILED" = "Không mở được tệp";
"SkyLib::TRANSFER_TOO_MANY_PARALLEL" = "Quá nhiều phiên chuyển tệp đồng thời";

/* ===== SKSkypeKitErrorDomain Errors ===== */

/* SKErrorOffline */
"SKERROR_OFFLINE_DESCRIPTION" = "Bạn đang offline.";

"SKERROR_OFFLINE_CALL_FAILUREREASON" = "Bạn cần online để thực hiện cuộc gọi.";
"SKERROR_OFFLINE_CONTACTSEARCH_FAILUREREASON" = "Bạn không thể tìm kiếm liên hệ khi đang offline. Hãy thay đổi trạng thái của bạn và thử lại.";
"SKERROR_OFFLINE_SMS_FAILUREREASON" = "Bạn cần online để gửi SMS.";

/* [#HELLC-894] */
"SKERROR_OFFLINE_VOICEMAIL_FAILUREREASON" = "Bạn cần online để phát tin nhắn này.";

/* Alert sheet title */
"SKERROR_CANNOT_SET_BODY_SMS_DESCRIPTION" = "Không thể đặt phần nội dung của SMS hiện tại.";


/* SKErrorInsufficientFunds */
"Sms::INSUFFICIENT_FUNDS" = "Bạn không có đủ Tín dụng Skype để gửi SMS.";
"CMEMBER_PSTN_STATUSTEXT_INSUFFICIENTCREDIT" = "Bạn cần có Tín dụng Skype để gọi tới số này.";

/* SKErrorInvalidContact */
"SKERROR_INVALIDCONTACT" = "Đó không phải là Tên Skype hoặc số điện thoại hợp lệ.";

/* SKErrorCallOfflineLyncContact */
"SKERROR_OFFLINELYNCCONTACT_CALL_FAILUREREASON" = "Bạn không thể gọi điện đến liên hệ trên Lync này vì họ đang offline.";

/* SKErrorBlockedContact */
"SKERROR_CONTACTBLOCKED_CALL_FAILUREREASON" = "Bạn không thể gọi điện cho người này vì bạn đã chặn họ.";
"SKERROR_CONTACTBLOCKED_CHAT_FAILUREREASON" = "Bạn không thể trò chuyện với người này vì bạn đã chặn họ.";
"SKERROR_CONTACTBLOCKED_SMS_FAILUREREASON" = "Bạn không thể gửi SMS cho người này vì bạn đã chặn họ.";
"SKERROR_CONTACTBLOCKED_ADD_FAILUREREASON" = "Bạn không thể thêm người này vì bạn đã chặn họ.";

/* SKErrorCantTalkToYourself */
"SKERROR_CANTTALKTOYOURSELF_CALL_FAILUREREASON" = "Bạn không thể tự gọi cho mình.";
"SKERROR_CANTTALKTOYOURSELF_CHAT_FAILUREREASON" = "Bạn không thể tự trò chuyện với mình.";
"SKERROR_CANTTALKTOYOURSELF_ADD_FAILUREREASON"  = "Bạn không thể tự thêm mình.";

/* SKErrorCantJoinConversation */
"SKERROR_CANTJOINCONVERSATION_FAILUREREASON" = "Bạn không thể tham gia hội thoại này";

/* SKErrorCantFindConversation */
"SKERROR_CANTFINDCONVERSATION_FAILUREREASON" = "Không thể tìm thấy cuộc hội thoại này";

/* SKErrorInvalidPSTNNumber */
"CMEMBER_PSTN_STATUSTEXT_INVALIDNUMBER" = "Đó không phải là số điện thoại hợp lệ.";

/* SKErrorEmergencyPSTNNumber */
"SKERROR_EMERGENCYCALL_FAILUREREASON" = "Bạn không thể gọi số này vì đó là số khẩn cấp.";
"SKERROR_EMERGENCYSMS_FAILUREREASON" = "Bạn không thể gửi SMS tới số này vì đó là số khẩn cấp.";
"SKERROR_EMERGENCYADD_FAILUREREASON" = "Bạn không thể thêm số này vì đó là số khẩn cấp.";

/* SKErrorCallExists */
"SKERROR_CALLEXISTS_CALL" = "Bạn cần kết thúc cuộc gọi này để có thể bắt đầu cuộc gọi mới.";
"SKERROR_CALLEXISTS_VOICEMAIL" = "Để nghe tin nhắn thoại, trước tiên hãy kết thúc cuộc gọi này.";
"SKERROR_CALLFAILED" = "Không gọi được. Vui lòng thử lại.";

/* SKErrorTooManyChatParticipants */
"SKERROR_TOOMANYPARTICIPANTS_CHAT_DESCRIPTION" = "Bạn đã muốn bắt đầu hội thoại với quá nhiều liên hệ.";

/* SKErrorInvalidConversationIdentities */
"SKERROR_INVALIDCONVERSATIONIDENTITIES_DESCRIPTION" = "Bạn không thể tham gia hội thoại với các liên hệ này.";

/* CMEMBER_FAILUREREASON */
"CMEMBER_FAILUREREASON_CALLER_NOT_AUTHORIZED" = "Bạn không thể gọi điện cho người này vì họ chưa chấp nhận yêu cầu liên hệ của bạn.";
"CMEMBER_FAILUREREASON_CALLER_NOT_FRIEND" = "Bạn không thể gọi điện cho người này vì họ chưa chấp nhận yêu cầu liên hệ của bạn.";

/* SMS_FAILUREREASON */
"Sms::INVALID_CONFIRMATION_CODE" = "Mã xác nhận không hợp lệ";
"Sms::MISC_ERROR" = "Số điện thoại không hợp lệ";

/* Conversation::PREMIUM_VIDEO_STATUS */

/*
"PV_RESULT_400_BAD_REQUEST_SOME_FIELDS_MISSING_MESSAGE" = "PV_RESULT_400_BAD_REQUEST_SOME_FIELDS_MISSING_MESSAGE";
"PV_RESULT_401_P2P_BLOCK_MESSAGE" = "PV_RESULT_401_P2P_BLOCK_MESSAGE";
*/

"PV_RESULT_403_PAID_SERVICE_BLOCK_MESSAGE" = "Tài khoản của bạn đã bị chặn.";
"PV_RESULT_403_PAID_SERVICE_BLOCK_EXPLANATION" = "Hãy liên hệ với bộ phận hỗ trợ khách hàng.";

"PV_RESULT_405_GROUP_TOO_LARGE_MESSAGE" = "Có quá nhiều người trong cuộc gọi này nên không thể thực hiện cuộc gọi video nhóm.";
"PV_RESULT_405_GROUP_TOO_LARGE_EXPLANATION" = "Bạn chỉ có thể thực hiện cuộc gọi video nhóm với tối đa 9 người. Hãy loại bỏ bớt mọi người khỏi nhóm này và thử lại.";

/*
"PV_RESULT_410_NO_VALID_SUBSCRIPTION_BUT_TRIAL_IS_AVAILABLE_MESSAGE" = "PV_RESULT_410_NO_VALID_SUBSCRIPTION_BUT_TRIAL_IS_AVAILABLE_MESSAGE";
*/

"PV_RESULT_412_SUBSCRIPTION_INSUFFICENT_FOR_THIS_CALL_MESSAGE" = "Có quá nhiều người trong cuộc gọi này nên không thể thực hiện cuộc gọi video nhóm.";
"PV_RESULT_412_SUBSCRIPTION_INSUFFICENT_FOR_THIS_CALL_EXPLANATION_BETA" = "Bạn chỉ có thể thực hiện cuộc gọi video với tối đa 9 người. Hãy loại bỏ bớt mọi người khỏi hội thoại này và thử lại.";
"PV_RESULT_412_SUBSCRIPTION_INSUFFICENT_FOR_THIS_CALL_EXPLANATION" = "Thuê bao gọi video nhóm của bạn không bao gồm nhiều người như vậy. Hãy loại bỏ bớt mọi người khỏi hội thoại này và thử lại.";

"PV_RESULT_414_NO_SUBSCRIPTION_MESSAGE_BETA" = "Bạn cần có thuê bao để thực hiện cuộc gọi video nhóm.";
"PV_RESULT_414_NO_SUBSCRIPTION_MESSAGE" = "Bạn cần có thuê bao để thực hiện cuộc gọi video nhóm.";
"PV_RESULT_414_NO_SUBSCRIPTION_EXPLANATION_BETA" = "Bạn muốn thực hiện cuộc gọi video nhóm?";
"PV_RESULT_414_NO_SUBSCRIPTION_EXPLANATION" = "Bạn muốn thực hiện cuộc gọi video nhóm?";

"PV_RESULT_416_SUBSCRIPTION_IS_ALREADY_IN_USE_MESSAGE" = "Bạn đã ở trong một cuộc gọi video nhóm.";
"PV_RESULT_416_SUBSCRIPTION_IS_ALREADY_IN_USE_EXPLANATION" = "Bạn chỉ có thể thực hiện một cuộc gọi video nhóm cùng lúc.";

"PV_RESULT_420_FAIR_USAGE_POLICY_VIOLATION_CALL_LIMIT_REACHED_MESSAGE" = "Bạn đã đạt tới giới hạn đối với cuộc gọi này.";
"PV_RESULT_420_FAIR_USAGE_POLICY_VIOLATION_CALL_LIMIT_REACHED_EXPLANATION_BETA" = "Bạn đã đạt tới giới hạn video nhóm trong 4 giờ đối với cuộc gọi này.";
"PV_RESULT_420_FAIR_USAGE_POLICY_VIOLATION_CALL_LIMIT_REACHED_EXPLANATION" = "Bạn đã đạt tới giới hạn video nhóm trong 4 giờ đối với cuộc gọi này. Hãy kiểm tra tài khoản của bạn để biết thông tin chi tiết.";

"PV_RESULT_422_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_DAY_LIMIT_REACHED_MESSAGE" = "Bạn đã đạt tới giới hạn video nhóm cho hôm nay.";
"PV_RESULT_422_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_DAY_LIMIT_REACHED_EXPLANATION" = "Tính năng gọi video nhóm tạm thời bị dừng. Bạn đã đạt đến giới hạn sử dụng hợp lý cho hôm nay. Hãy kiểm tra tài khoản của bạn để biết thông tin chi tiết.";

"PV_RESULT_424_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_MONTH_LIMIT_REACHED_MESSAGE" = "Bạn đã đạt tới giới hạn video nhóm cho tháng này.";
"PV_RESULT_424_FAIR_USAGE_POLICY_VIOLATION_SPONSORS_MONTH_LIMIT_REACHED_EXPLANATION" = "Tính năng gọi video nhóm tạm thời bị tạm dừng. Bạn đã đạt đến giới hạn sử dụng hợp lý cho tháng này. Hãy kiểm tra tài khoản của bạn để biết thông tin chi tiết.";

/*
"PV_RESULT_430_GRACE_TIME_EXPIRED_MESSAGE" = "RESULT_430_GRACE_TIME_EXPIRED";
*/

"PV_RESULT_500_GENERAL_SERVICE_ERROR_MESSAGE" = "Video nhóm hiện không khả dụng.";
"PV_RESULT_500_GENERAL_SERVICE_ERROR_EXPLANATION" = "Đã xảy ra lỗi. Vui lòng thử lại sau.";

/*
"PV_RESULT_503_SERVICE_TIMEOUT_MESSAGE" = "RESULT_503_SERVICE_TIMEOUT";
*/

"PremiumVideoErrorRecovery_GetPremium_BETA" = "Tải phiên bản có tính năng gọi video nhóm";
"PremiumVideoErrorRecovery_GetPremium" = "Tải phiên bản có tính năng gọi video nhóm";
"PremiumVideoErrorRecovery_UpgradePremium" = "Nâng cấp";

/* ===== SKAccessSessionFailureReasonErrorDomain Errors ===== */

"AccessSession::NO_BALANCE" = "Bạn cần có Tín dụng Skype để sử dụng Skype WiFi.";
"AccessSession::LOGIN_FAILURE" = "Chúng tôi không nhận dạng được Tên Skype và mật khẩu của bạn.";
"AccessSession::WISPR_LOGIN_REJECTED" = "Tên người dùng hoặc mật khẩu không hợp lệ.";

"SKYPEACCESS_NO_ACCOUNT" = "Hãy đăng nhập bằng Tài khoản Skype của bạn.";

"SKYPEACCESS_GENERIC_CONNECTION_ERROR" = "Không thể kết nối. Hãy kiểm tra cường độ tín hiệu WiFi hoặc thử một điểm truy cập khác.";
"SKYPEACCESS_GENERIC_FATAL_ERROR" = "Điểm truy cập này không phản hồi bình thường. Hãy thử một điểm truy cập khác.";

"SKYPEACCESS_SESSION_EXTEND_ERROR" = "Không thể mở rộng phiên. Hãy thử kết nối lại.";

"SKYPEACCESS_SESSION_LOSTWIFI_MESSAGE" = "Không còn mạng WiFi “%@”";
"SKYPEACCESS_SESSION_LOSTWIFI_EXPLANATION" = "Để tránh bị tính phí ngoài dự kiến, hãy luôn ngắt kết nối đúng cách trước khi chuyển khỏi điểm truy cập hoặc tắt thiết bị của bạn.";

"SKYPEACCESS_SESSION_LOSTWIFI_RECOVERABLE_MESSAGE" = "Hãy tham gia mạng WiFi “%@”";
"SKYPEACCESS_SESSION_LOSTWIFI_RECOVERABLE_EXPLANATION" = "Skype WiFi sẽ tìm cách dừng kết nối Internet. Để tránh bị tính phí ngoài dự kiến, hãy luôn ngắt kết nối đúng cách trước khi chuyển khỏi điểm truy cập hoặc tắt thiết bị của bạn.";

"SKYPEACCESS_SESSION_LOSTWIFI_AUTO_END_MESSAGE" = "Kết nối Internet của bạn đã bị dừng lại.";

"ACCESS_PRICE_PER_MINUTE_FORMAT" = "%@ mỗi phút";
"ACCESS_PRICE_PER_MINUTE_FREE" = "Miễn phí";

/*
 * ===========
 * SkyLib localization (Skype Kit messages sent by SkyLib to other clients)
 * ===========
 */

/* Message sent in the P2P chat after it has been migrated to a server-based chat, and seen by legacy client users. */
"LOCALIZED_UPGRADE_MESSAGE_IN_P2P" = "đã cập nhật trải nghiệm trò chuyện tốt hơn cho nhóm này.\nĐể tham gia và trò chuyện, hãy tải xuống phiên bản mới nhất\nĐi tới <a href=\"http://www.skype.com/updateme\">Skype.com/updateme</a>.";
"LOCALIZED_UPGRADE_MESSAGE_IN_P2P_DOGFOOD" = "đã cập nhật trải nghiệm trò chuyện tốt hơn cho nhóm này.\nĐể tham gia và trò chuyện, hãy tải xuống phiên bản mới nhất\nĐi tới https://microsoft.sharepoint.com/teams/DogfoodSkype/.";

/* Message sent in the server-based chat as first message. Used to link the history of both conversations. The '%1' is replaced with the ID of the old chat. */
"LOCALIZED_UPGRADE_MESSAGE_IN_SERVER_BASED" = "Bấm vào <a href=\"skype:?chat&amp;id=%1\">đây</a> để xem lịch sử trước.";
